{
  "navbar": {
    "home": "Home",
    "aboutMe": "About me",
    "experience": "Experience",
    "education": "Education",
    "portfolio": "Portfolio"
  },
  "home": {
    "welcomeText": "Hello !",
    "typewriterStrings": [
      "I am Maciek Górnicki.",
      "I am a Frontend Developer.",
      "I am a Freelancer."
    ],
    "quote": "The only way to be truly satisfied is to do what you believe is great work, and the only way to do great work is to love what you do - Steve Jobs"
  },
  "aboutMe": {
    "sectionHead": {
      "h3Text": "About me",
      "h5Text": "bout me",
      "spanText": "A"
    },
    "header": " My name is Maciek. I am { birthYear } years old.",
    "paragraph": "I am an information technology professional who has been passionate about programming for over a decade. My commercial experience includes over {experienceYears} years of work as a programmer and 3 years as an IT system administrator, where I was mainly responsible for the ERP system. In 2021, I decided to start my own business, which allowed me to develop as a freelancer. In my free time, I create IoT solutions for my own needs.",
    "phone": "Phone",
    "location": "Location"
  },
  "experience": {
    "sectionHead": {
      "h3Text": "Experience",
      "h5Text": "xperience",
      "spanText": "E"
    },
    "description": "Description",
    "mainActivities": "Main activities",
    "timelineItems": [
      {
        "dateFrom": "01.2021",
        "dateTo": "Present",
        "companyName": "Statscore SP. Z O.O.",
        "position": "Fullstack developer",
        "description": "Maintenance and development applications for collecting, processing, and presenting sports data.",
        "mainActivities": [
          "Design and implement solutions for backend and frontend.",
          "Integration with other data providers.",
          "Writing unit tests and end-to-end (e2e) tests."
        ],
        "technologies": ["Vue", "NestJs", "RabbitMQ", "MongoDB", "MySQL", "TypeScript", "PWA"]
      },
      {
        "dateFrom": "01.2021",
        "dateTo": "Present",
        "companyName": "Maciej Górnicki Bearly Software",
        "position": "Owner",
        "description": ""
      },
      {
        "dateFrom": "10.2019",
        "dateTo": "12.2020",
        "companyName": "Agora S.A.",
        "position": "Frontend Developer",
        "description": "Maintenance and development website www.sport.pl and www.wyniki.sport.pl",
        "mainActivities": [
          "Design and implement solutions for frontend",
          "Work related to SEO and advertising",
          "Integration with data provider APIs",
          "Writing unit tests and end-to-end (e2e) tests."
        ],
        "technologies": ["Vue", "Nuxt", "TypeScript"]
      },
      {
        "dateFrom": "01.2018",
        "dateTo": "10.2019",
        "companyName": "Final S.A.",
        "position": "Programmer / IT System Administrator",
        "description": "Managing the ERP system. Creating various types of applications for the company's needs.",
        "mainActivities": [
          "Creating applications",
          "Managing the ERP system, bug fixing",
          "Creating reports using SQL queries."
        ],
        "technologies": ["SQL", "Python", "jQuery", "IoT"]
      },
      {
        "dateFrom": "09.2017",
        "dateTo": "12.2017",
        "companyName": "Final S.A.",
        "position": "IT Specialist",
        "description": "Administering IT systems such as Linux servers, AD, Veem, VMware, ERP, MES"
      }
    ]
  },
  "education": {
    "sectionHead": {
      "h3Text": "Education",
      "h5Text": "ducation",
      "spanText": "E"
    },
    "timelineItems": [
      {
        "dateFrom": "01.2016",
        "dateTo": "03.2020",
        "companyName": "Engineering studies",
        "position": "WSB University",
        "description": "I graduated with a bachelor's degree in computer science, with a specialization in Internet of Things"
      },
      {
        "dateFrom": "09.2014",
        "dateTo": "04.2016",
        "companyName": "IT TECHNICIAN",
        "position": "Electronic technical high school",
        "description": ""
      }
    ]
  },
  "portfolio": {
    "descriptionText": "Description",
    "technologiesText": "Technologies",
    "items": [
      {
        "name": "Logistics System",
        "description": "The example application I have created is a Logistics System, designed to streamline the management of production basket flow for the client. Previously, the client had limited control over the quantity of baskets sent to customers and received from suppliers. The application consists of two main modules: a web application and a mobile application available on scanners. Within the system, logistics department employees can create WZ (Outbound Delivery) and PZ (Inbound Delivery) documents. During loading or unloading of a TIR, warehouse staff scan QR codes of baskets using a scanner, which are automatically added as items to the corresponding WZ or PZ document. Subsequently, a document is generated and handed over to the driver. The system supports multiple locations and enables tracking of the quantity of baskets available in the warehouse. Additionally, the application allows for generating various reports in Excel format, facilitating precise monitoring of warehouse status and production basket flow. Thanks to this system, the client gains full control over the flow of goods, eliminating errors resulting from manual monitoring.",
        "mainImage": "src/assets/portfolio/system-logistyczny1.png",
        "images": [
          "src/assets/portfolio/system-logistyczny1.png",
          "src/assets/portfolio/system-logistyczny2.png",
          "src/assets/portfolio/system-logistyczny3.png",
          "src/assets/portfolio/system-logistyczny4.png",
          "src/assets/portfolio/system-logistyczny5.png",
          "src/assets/portfolio/system-logistyczny6.png"
        ],
        "technologies": ["Vue", "NestJS", "MongoDB", "Ionic"],
        "projectDate": "06.2023"
      },
      {
        "name": "Coronavirus in Poland",
        "description": "During the coronavirus pandemic, when the majority of society was faced with the necessity of staying at home, I decided to use this time productively by creating a website that allows tracking current statistics regarding infections. This project involved comprehensive compilations of data concerning the number of cases both at the national and international levels, considering various geographical aspects such as provinces and counties. The application was developed in the form of a Progressive Web App (PWA) as well as a desktop version, enabling users easy access to the necessary information on different devices. As part of the project, I also created an interactive map of Poland. The daily updated data ensured that the information presented on it was always fresh, which was crucial in the context of the rapidly changing epidemiological situation. Additionally, the map indicated the applicable restriction zones, which served as an important guideline for local communities. The project garnered widespread social interest, reaching up to 200,000 unique users per month at its peak. Approximately a year after its launch, the statistical data provided by the application was utilized for scientific purposes by the renowned Institute of Biomedical Engineering at the University of Oxford, indicating the high quality and utility of the project.",
        "mainImage": "src/assets/portfolio/koronawirus3.png",
        "images": [
          "src/assets/portfolio/koronawirus1.png",
          "src/assets/portfolio/koronawirus2.png",
          "src/assets/portfolio/koronawirus3.png",
          "src/assets/portfolio/koronawirus4.png"
        ],
        "technologies": ["Vue", "NestJS", "MongoDB", "Python"],
        "projectDate": "03.2021"
      },
      {
        "name": "Save the show",
        "description": "On behalf of Teatr Nowy in Łódź, I had the pleasure of creating an interactive educational game dedicated to the youngest theater enthusiasts. In the game, players assume the roles of four theater employees, where each mission represents a unique adventure. Each stage involves watching a video prepared by the theater staff, after which players make decisions regarding the choice of the path leading to the spectacle. This project not only provides entertainment but also develops logical thinking skills and creativity in the youngest participants. Through the interactive nature of the game, children have the opportunity to learn about the backstage of the theater and understand the role of individual workers behind the scenes, which can foster their interest in culture and art. This game represents not only an attractive form of entertainment but also an educational tool that integrates play with learning, inspiring children to discover the world of theater in a new and interactive way.",
        "mainImage": "src/assets/portfolio/uratuj-spektakl1.png",
        "images": [
          "src/assets/portfolio/uratuj-spektakl1.png",
          "src/assets/portfolio/uratuj-spektakl2.png"
        ],
        "technologies": ["Vue"],
        "projectDate": "12.2020",
        "website": {
          "name": "nowy.pl/gra/",
          "url": "https: //nowy.pl/gra/"
        }
      },
      {
        "name": "Monitoring system",
        "description": "Using Raspberry Pi technology and a set of temperature, humidity, and smoke sensors, I have developed an innovative system for monitoring key parameters in server rooms. This project focuses on continuously monitoring environmental conditions in server rooms. By employing advanced sensors, the system is capable of continuously recording temperature, humidity, and smoke presence. In case of anomalies such as excessively high or low temperature, or the presence of smoke, the system promptly notifies the user by sending SMS alerts and notifications through a dedicated mobile application. Furthermore, all measurement data is stored in a database, allowing users to access the measurement history. This enables server room administrators to track changes in environmental conditions over time and take appropriate preventive actions if necessary. This project not only ensures continuous protection of IT infrastructure by monitoring environmental conditions but also enables swift response to any potential threats, thereby increasing the reliability and safety of server room operations",
        "mainImage": "src/assets/portfolio/monitoring4.png",
        "images": [
          "src/assets/portfolio/monitoring1.png",
          "src/assets/portfolio/monitoring2.png",
          "src/assets/portfolio/monitoring3.png"
        ],
        "technologies": ["Raspberry Pi", "Arduino", "Cordova", "Python", "MySQL"],
        "projectDate": "01.2019"
      },
      {
        "name": "Customer application",
        "description": "During my tenure as a systems administrator, I recognized the need for creating a modern tool that would facilitate clients' access to essential data. In response to this requirement, I decided to develop an innovative portal enabling clients to track their invoices, delivery notes, and orders in real-time. The aim of this project was not only to provide clients with convenient access to information but also to create a platform that integrates seamlessly with the ERP system, ensuring smooth data exchange. Thanks to this solution, clients can rest assured that the presented information is always up-to-date and reliable. While designing this portal, I placed particular emphasis on user-friendly simplicity and intuitive user interface. I aimed to make the portal easily accessible even to individuals unfamiliar with technology, allowing them to quickly find the necessary information. Throughout the project, I consulted with clients to understand their needs and expectations better. The client portal, which I had the pleasure of creating, has become a significant tool within the company, enabling the enhancement of customer service standards and the cultivation of stronger relationships with our business partners.",
        "mainImage": "src/assets/portfolio/portal-klienta1.png",
        "images": [
          "src/assets/portfolio/portal-klienta1.png",
          "src/assets/portfolio/portal-klienta2.png"
        ],
        "technologies": ["MySQL", "Python", "JavaScript"],
        "projectDate": "04.2019"
      },
      {
        "name": "Website for the IT department",
        "description": "While previously working as a systems administrator, I had the opportunity to create a web application for the IT department, which streamlined operations across the entire department. The application was designed to improve the management of IT equipment, the process of issuing equipment transfer and receipt documents, and the creation of purchase lists. In response to the introduction of the new personal data protection law, I enhanced the portal with a GDPR module. This module consists of a breach register, a processing areas register, and a register of personal data collections. Through this module, users can effectively monitor compliance with personal data protection regulations, contributing to the enhancement of security and compliance with applicable regulations in our operations.",
        "mainImage": "src/assets/portfolio/portal-it1.png",
        "images": ["src/assets/portfolio/portal-it1.png", "src/assets/portfolio/portal-it2.png"],
        "technologies": ["MySQL", "Python", "JavaScript"],
        "projectDate": "06.2019"
      },
      {
        "name": "Website",
        "description": "On the client's request, I created a simple company website consisting of a homepage and a subpage featuring interesting facts. The website's graphic design was my own creation. Additionally, I developed a custom CMS allowing for the addition of interesting facts and the editing of elements on the website. The website was built using standard web technologies, PHP, MySQL, and in accordance with the latest SEO and RWD standards.",
        "mainImage": "src/assets/portfolio/ema1.png",
        "images": ["src/assets/portfolio/ema1.png", "src/assets/portfolio/ema2.png"],
        "technologies": ["MySQL", "PHP", "JavaScript"],
        "projectDate": "11.2018",
        "website": {
          "name": "pomoc-poszkodowanym.eu/",
          "url": "https: //pomoc-poszkodowanym.eu/"
        }
      }
    ]
  }
}
